; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v1 ?v2)
             (pred_11 ?v8 ?v11)
             (pred_3 ?v1 ?v11)
             (pred_9 ?v6 ?v1 )
	     (pred_5 ?v1)
             (pred_6 ?v12)
             (pred_10 ?v8)
             (pred_4 ?v11)
             (pred_7 ?v1)
             (pred_12 ?v8)
             (pred_1 ?v1)
             (pred_8 ))



(:action op_1
:parameters (?v4 ?v9 ?v3 ?v10)
:precondition (and (pred_6 ?v4) (pred_6 ?v9) (pred_10 ?v3) (pred_4 ?v10)
          (pred_2 ?v4 ?v9) (pred_11 ?v3 ?v10)
                   (pred_3 ?v9 ?v10) (pred_5 ?v4) 
                   (pred_7 ?v9) (pred_12 ?v3))
:effect (and  (pred_1 ?v9) (not (pred_7 ?v9))))


(:action op_2
:parameters (?v4 ?v5)
:precondition (and (pred_6 ?v4) (pred_6 ?v5)
               (pred_5 ?v4) (pred_2 ?v4 ?v5) (pred_1 ?v5))
:effect (and (pred_5 ?v5) (not (pred_5 ?v4))))

(:action op_5
:parameters (?v4 ?v3)
:precondition (and (pred_6 ?v4) (pred_10 ?v3) 
                  (pred_5 ?v4) (pred_9 ?v3 ?v4) (pred_8 ))
:effect (and (pred_12 ?v3)
   (not (pred_9 ?v3 ?v4)) (not (pred_8 ))))


(:action op_3
:parameters (?v4 ?v13 ?v7)
:precondition (and (pred_6 ?v4) (pred_10 ?v13) (pred_10 ?v7)
                  (pred_5 ?v4) (pred_12 ?v7) (pred_9 ?v13 ?v4))
:effect (and (pred_12 ?v13) (pred_9 ?v7 ?v4)
        (not (pred_12 ?v7)) (not (pred_9 ?v13 ?v4))))

(:action op_4
:parameters (?v4 ?v3)
:precondition (and (pred_6 ?v4) (pred_10 ?v3) 
                  (pred_5 ?v4) (pred_12 ?v3))
:effect (and (pred_8 ) (pred_9 ?v3 ?v4) (not (pred_12 ?v3)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_21 obj_14 obj_05 obj_13 obj_12 obj_04 obj_16 obj_06 obj_01 obj_17 obj_15 obj_09 obj_18 obj_19 obj_07
    obj_03 obj_10
    obj_20 obj_02 obj_11
    )

    (:init
       (pred_8)

       (pred_6 obj_08)
       (pred_6 obj_21)
       (pred_6 obj_14)
       (pred_6 obj_05)
       (pred_6 obj_13)
       (pred_6 obj_12)
       (pred_6 obj_04)
       (pred_6 obj_16)
       (pred_6 obj_06)
       (pred_6 obj_01)
       (pred_6 obj_17)
       (pred_6 obj_15)
       (pred_6 obj_09)
       (pred_6 obj_18)
       (pred_6 obj_19)
       (pred_6 obj_07)
       (pred_4 obj_03)
       (pred_4 obj_10)
       (pred_10 obj_20)
       (pred_10 obj_02)
       (pred_10 obj_11)

       (pred_2 obj_08 obj_13)
       (pred_2 obj_08 obj_21)
       (pred_2 obj_21 obj_12)
       (pred_2 obj_21 obj_14)
       (pred_2 obj_21 obj_08)
       (pred_2 obj_14 obj_04)
       (pred_2 obj_14 obj_05)
       (pred_2 obj_14 obj_21)
       (pred_2 obj_05 obj_16)
       (pred_2 obj_05 obj_14)
       (pred_2 obj_13 obj_06)
       (pred_2 obj_13 obj_12)
       (pred_2 obj_13 obj_08)
       (pred_2 obj_12 obj_01)
       (pred_2 obj_12 obj_04)
       (pred_2 obj_12 obj_21)
       (pred_2 obj_12 obj_13)
       (pred_2 obj_04 obj_17)
       (pred_2 obj_04 obj_16)
       (pred_2 obj_04 obj_14)
       (pred_2 obj_04 obj_12)
       (pred_2 obj_16 obj_15)
       (pred_2 obj_16 obj_05)
       (pred_2 obj_16 obj_04)
       (pred_2 obj_06 obj_09)
       (pred_2 obj_06 obj_01)
       (pred_2 obj_06 obj_13)
       (pred_2 obj_01 obj_18)
       (pred_2 obj_01 obj_17)
       (pred_2 obj_01 obj_12)
       (pred_2 obj_01 obj_06)
       (pred_2 obj_17 obj_19)
       (pred_2 obj_17 obj_15)
       (pred_2 obj_17 obj_04)
       (pred_2 obj_17 obj_01)
       (pred_2 obj_15 obj_07)
       (pred_2 obj_15 obj_16)
       (pred_2 obj_15 obj_17)
       (pred_2 obj_09 obj_18)
       (pred_2 obj_09 obj_06)
       (pred_2 obj_18 obj_19)
       (pred_2 obj_18 obj_01)
       (pred_2 obj_18 obj_09)
       (pred_2 obj_19 obj_07)
       (pred_2 obj_19 obj_17)
       (pred_2 obj_19 obj_18)
       (pred_2 obj_07 obj_15)
       (pred_2 obj_07 obj_19)
       (pred_7 obj_01)
       (pred_7 obj_07)
       (pred_7 obj_09)
       (pred_3  obj_01 obj_03)
       (pred_3  obj_07 obj_10)
       (pred_3  obj_09 obj_10)
       (pred_1 obj_08)
       (pred_1 obj_21)
       (pred_1 obj_14)
       (pred_1 obj_05)
       (pred_1 obj_13)
       (pred_1 obj_12)
       (pred_1 obj_04)
       (pred_1 obj_16)
       (pred_1 obj_06)
       (pred_1 obj_17)
       (pred_1 obj_15)
       (pred_1 obj_18)
       (pred_1 obj_19)

       (pred_11  obj_20 obj_03)
       (pred_11  obj_02 obj_10)
       (pred_11  obj_11 obj_10)
       (pred_9 obj_20 obj_04)
       (pred_9 obj_02 obj_08)
       (pred_9 obj_11 obj_05)
       (pred_5 obj_15)
    )

    (:goal (and
       (pred_9 obj_11 obj_14)
    ))
(:constraints
  (always (not (pred_5 obj_16)))
)
)

; plan
1. (op_2 obj_15 obj_17)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_17)
   goals met: 0 of 1
2. (op_2 obj_17 obj_04)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_04)
   goals met: 0 of 1
3. (op_2 obj_04 obj_14)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_14)
   goals met: 0 of 1
4. (op_2 obj_14 obj_05)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_05)
   goals met: 0 of 1
5. (op_5 obj_05 obj_11)
   deleted: (pred_9 obj_11 obj_05) (pred_8)
   added: (pred_12 obj_11)
   goals met: 0 of 1
6. (op_2 obj_05 obj_14)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_14)
   goals met: 0 of 1
7. (op_4 obj_14 obj_11)
   deleted: (pred_12 obj_11)
   added: (pred_8) (pred_9 obj_11 obj_14)
   goals met: 1 of 1
